Tekla Open API Reference for Tekla Structures 2025
ImageItem Class
 The ImageItem class defines the images that will be contained in the image combo box.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Dialog.UIControls.ImageItem
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ImageItem : ISerializable
<SerializableAttribute>
Public Class ImageItem
	Implements ISerializable
The ImageItem type exposes the following members.
Properties
Name | Description
Name
 Gets or sets the image name.
Picture
 Gets or sets the image.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace